namespace Shipping_System.BL.Helper
{
    public class AllPermission
    {
        public AllPermission()
        {
            PermissionsList = new List<string>()
            {
                "اضافة موظف",
                "تعديل موظف",
                "عرض الموظفين",
                "حذف موظف",
                "اضافة تاجر",
                "تعديل تاجر",
                "عرض التجار",
                "حذف تاجر",
                "اضافة مندوب",
                "تعديل مندوب",
                "عرض المناديب",
                "حذف مندوب",
                "اضافة محافظة",
                "تعديل محافظة",
                "عرض المحافظات",
                "حذف محافظة",
                "اضافة مدينة",
                "تعديل مدينة",
                "عرض المدن",
                "حذف مدينة",
                "اضافة فرع",
                "تعديل فرع",
                "عرض الافرع",
                "حذف فرع",
                "اضافة صلاحية",
                "تعديل صلاحية",
                "عرض الصلاحيات",
                "حذف صلاحية",
                "اضافة طلب",
                "عرض الطلبات",
                "تعديل طلب",
                "حذف طلب",
                "عرض تقارير الطلبات",
                "تفير حالة طلب",
                "عرض تفاصيل طلب",
                "اضافة اعداد شحن",
                "تعديل اعداد شحن",
                "عرض اعدادات الشحن",
                "حذف اعدات الشحن",
                "عرض اعداد القرية",
                "تعديل اعداد القرية",
                "عرض اعداد الوزن",
                "تعديل اعداد الشحن",
              

            };
        }
        public List<string> PermissionsList;

    }
}
